{
    "intents":[
       {
          "tag":"greeting",
          "patterns":[
             "Hi there",
             "How are you",
             "Is anyone there?",
             "Hey",
             "Hola",
             "Hello",
             "Good day",
             "Hi",
             "Hello"
          ],
          "responses":[
             "Hello, thanks for asking",
             "Good to see you again",
             "Hi there, how can I help?",
             "Hi! How can I help you today?",
            "Hello there! What can I assist you with?",
            "Hey! How may I be of service?",
            "Good [morning/afternoon/evening]! Let me know what you need help with.",
            "I'm doing well, thanks for asking. How can I assist you?",
            "Hello",
            "Hi there"
                     ],
          "context":[
             ""
          ]
       },
       {
          "tag":"thanks",
          "patterns":[
             "Thanks",
             "Thank you",
             "That's helpful",
             "Awesome, thanks",
             "Thanks for helping me",
             "Thank you for your time."
          ],
          "responses":[
             "Happy to help!",
             "Any time!",
             "My pleasure",
             "You're welcome! Is there anything else I can assist you with?",
            "I'm glad I could help. Let me know if there's anything else you need.",
            "No problem, happy to assist you. Is there anything else I can do for you?",
            "You're welcome! It was my pleasure to help you.",
            "I'm always here to help. Let me know if you have any other questions or concerns.",
            "Anytime! I'm here to make things easier for you.",
            "Thank you for letting me assist you. Don't hesitate to contact me if you need anything else."
          ],
          "context":[
             ""
          ]
       },
       {
        "tag": "about",
        "patterns":[
            "Who are you?", "What are you?", "Who you are?", "Who is there?", "what is your name?", "what's your name", "whats your name?"
        ],
        "responses" :[
            "I am an inusrance agent working with", "I am working with...", "Hii..! My name is ...", "This is ..."
        ],
        "context":[]
        },
       {
        "tag" : "help",
        "patterns":[
            "Could you help me?", "give me a hand please", "Can you help?", "What can you do for me?", "I need a support", "I need a help", "support me please", "help please"
        ],
        "responses":[
            "Tell me, how can I assist you", "Yes sure, Tell me your problem to assist you", "Yes Sure, How can I support you"
        ],
        "context":[]
       },
       {
        "tag": "about_insurance",
        "patterns" :[
           "Okie","sure", "yes", "ok", "Okay send me options","send","Sure give me", "Yes","Ok","I need a insurance", "I want insurance for my family", "I need insurance for my kids", "I want insurance for my spouse", "I like to have a medical insurance for my husband", "I like to have a detal insurance for my wife"
         ],
        "responses":[
            "Ohh sure, Would like to help with that...!! What type of inusrance do you need?", "That's great, we have Dental, Medial and Health insurance.", "That's great, We have multiple options for you like 'Medical', 'Dental', 'Vision'.", "Awesome..!! I will surely help you with your insurance. Tell me what type of insurance do you need."
        ],
        "context":[]
       },
       
       {
       "tag": "negative_response",
       "patterns" : [
         "No", "No sorry", "Please stop messaging", "Stop", "Stop Texting", "Fuck You", "Go to hell", "Stop texting you bitch", "Bitch stop texting", "Fuck you bitch", "Not interested"
       ],
       "responses" :[
         "I'm sorry if I said anything that upset you. Is there anything specific that I can help you with?",
         "I apologize for any inconvenience caused. If you would like me to stop messaging you, please let me know and I will comply with your request.",
         "I understand that you're frustrated. Is there anything I can do to help address your concerns?",
         "I'm sorry to hear that. I'm here to assist you, so please let me know if there's anything you need.",
         "I'm sorry, I didn't mean to cause any offense. Can you tell me more about what's bothering you?",
         "I apologize if my messages are bothering you. If you would like me to stop messaging you, please just let me know."
       ]
       },
       {
         "tag" : "reserving_time",
         "patterns" : [
         "Call me tommorow", "call me monday", "Please call", "You can connect with me on Tuesday", "I am busy right now please call me later", "Book Time for me tomorrow", "Book at 12:40 Sunday"
         ],
         "responses" :[
          "Ok Sure! At what time should I call you?", "Tell me at what time I should reserve you for a call.", "So tell me when should I book a calendar for you." , "Let me know the best time to reach you!", "Kindly inform me the convenient time to reach you!", "Please state your preferred time for us to reach you!"
         ]
       },
       {
         "tag" : "already_insured",
         "patterns" : [
         "Sorry I am already insured.",
         "I already have insurance coverage.",
         "I'm currently covered by another insurance policy.",
         "Thanks for the offer, but I'm already insured elsewhere.",
         "I don't need insurance at this time, as I'm already covered.",
         "I've already purchased insurance from another provider.",
         "I appreciate the offer, but I'm already protected by an existing policy."
         ],
         "responses" :[
           " That's great to hear that you're already insured! Just to confirm, are you happy with your current coverage or are you considering other options?",
            "Thank you for letting me know that you're already insured. If you have any questions or concerns about your current coverage, I'm here to help.",
            "I understand that you're already insured. Is there anything specific that you're looking for assistance with today?",
            "Okay, I see that you're already insured. Is there anything else I can help you with or any questions you have about insurance in general?",
            "Thank you for telling me that you're already insured. If you ever need to update or make changes to your policy, feel free to reach out to me for assistance.",
            "That's great, but we have better options if you want to change you agent.",
            "I understand. If you have any questions about your existing coverage or are interested in learning more about our insurance policies in the future, feel free to reach out to me.",
            "Thank you for letting me know. If you have any questions about your current policy or would like to learn more about our insurance offerings, I'm here to help.",
            "Great, I'm glad to hear that you're already insured. If you have any questions or concerns about your existing policy, please don't hesitate to let me know.",
            "No problem, I understand. If you ever want to compare your current coverage to our policies or have any questions in the future, feel free to contact me.",
            "Thank you for letting me know. If you ever need to make changes to your current coverage or would like to explore additional insurance options, I'm here to assist you.",
            "Understood. If you ever have questions about your current insurance coverage or are interested in learning more about our policies, feel free to contact me.",
            "I appreciate you letting me know. If you have any questions about your current insurance policy or would like to explore additional insurance options in the future, please don't hesitate to contact me."
         ]
       }
    ]
 }